--连接查询：即多个表之间进行关联查询

--内连接查询  即取交集
    --inner join ... on on意味着条件
    select * from studuent inner join classes;
        +----+--------+------+--------+--------+--------+-----------+----+-------------+
        | id | name   | age  | height | gender | cls_id | is_delete | id | name        |
        +----+--------+------+--------+--------+--------+-----------+----+-------------+
        |  1 | 小明   |   18 | 168.00 | 女     |      1 |           |  1 | python01期  |
        |  1 | 小明   |   18 | 168.00 | 女     |      1 |           |  2 | python02期  |
        |  1 | 小明   |   18 | 168.00 | 女     |      1 |           |  3 | python04期  |
        |  2 | 小黄   |   17 | 175.00 | 男     |      2 |           |  1 | python01期  |
        |  2 | 小黄   |   17 | 175.00 | 男     |      2 |           |  2 | python02期  |
        |  2 | 小黄   |   17 | 175.00 | 男     |      2 |           |  3 | python04期  |
        |  3 | 小红   |   14 | 177.00 | 女     |      3 |           |  1 | python01期  |
        |  3 | 小红   |   14 | 177.00 | 女     |      3 |           |  2 | python02期  |
        |  3 | 小红   |   14 | 177.00 | 女     |      3 |           |  3 | python04期  |
        |  4 | 小汉   |   11 | 180.00 | 中性   |      4 |           |  1 | python01期  |
        |  4 | 小汉   |   11 | 180.00 | 中性   |      4 |           |  2 | python02期  |
        |  4 | 小汉   |   11 | 180.00 | 中性   |      4 |           |  3 | python04期  |
        |  5 | 小八   |   12 | 187.00 | 中性   |      5 |           |  1 | python01期  |
        |  5 | 小八   |   12 | 187.00 | 中性   |      5 |           |  2 | python02期  |
        |  5 | 小八   |   12 | 187.00 | 中性   |      5 |           |  3 | python04期  |
        |  6 | 小九   |   13 | 182.00 | 保密   |      6 |           |  1 | python01期  |
        |  6 | 小九   |   13 | 182.00 | 保密   |      6 |           |  2 | python02期  |
        |  6 | 小九   |   13 | 182.00 | 保密   |      6 |           |  3 | python04期  |
        |  7 | 小十   |   18 | 188.00 | 中性   |      7 |           |  1 | python01期  |
        |  7 | 小十   |   18 | 188.00 | 中性   |      7 |           |  2 | python02期  |
        |  7 | 小十   |   18 | 188.00 | 中性   |      7 |           |  3 | python04期  |
        |  8 | 小之   |   17 | 186.00 | 女     |      8 |           |  1 | python01期  |
        |  8 | 小之   |   17 | 186.00 | 女     |      8 |           |  2 | python02期  |
        |  8 | 小之   |   17 | 186.00 | 女     |      8 |           |  3 | python04期  |
        |  9 | 小一   |   10 | 188.00 | 女     |      9 |           |  1 | python01期  |
        |  9 | 小一   |   10 | 188.00 | 女     |      9 |           |  2 | python02期  |
        |  9 | 小一   |   10 | 188.00 | 女     |      9 |           |  3 | python04期  |
        | 10 | 小二   |   15 | 182.00 | 中性   |      9 |           |  1 | python01期  |
        | 10 | 小二   |   15 | 182.00 | 中性   |      9 |           |  2 | python02期  |
        | 10 | 小二   |   15 | 182.00 | 中性   |      9 |           |  3 | python04期  |
        | 11 | 小三   |   18 | 184.00 | 女     |      6 |           |  1 | python01期  |
        | 11 | 小三   |   18 | 184.00 | 女     |      6 |           |  2 | python02期  |
        | 11 | 小三   |   18 | 184.00 | 女     |      6 |           |  3 | python04期  |
        | 12 | 小四   |   19 | 185.00 | 保密   |      4 |           |  1 | python01期  |
        | 12 | 小四   |   19 | 185.00 | 保密   |      4 |           |  2 | python02期  |
        | 12 | 小四   |   19 | 185.00 | 保密   |      4 |           |  3 | python04期  |
        | 13 | 小五   |   13 | 190.00 | 女     |      3 |           |  1 | python01期  |
        | 13 | 小五   |   13 | 190.00 | 女     |      3 |           |  2 | python02期  |
        | 13 | 小五   |   13 | 190.00 | 女     |      3 |           |  3 | python04期  |
        | 14 | 小六   |   14 | 189.00 | 女     |      4 |           |  1 | python01期  |
        | 14 | 小六   |   14 | 189.00 | 女     |      4 |           |  2 | python02期  |
        | 14 | 小六   |   14 | 189.00 | 女     |      4 |           |  3 | python04期  |
        | 15 | 小七   |   15 | 178.00 | 女     |      5 |           |  1 | python01期  |
        | 15 | 小七   |   15 | 178.00 | 女     |      5 |           |  2 | python02期  |
        | 15 | 小七   |   15 | 178.00 | 女     |      5 |           |  3 | python04期  |
        | 16 | 十一   |   15 | 167.00 | 男     |      7 |           |  1 | python01期  |
        | 16 | 十一   |   15 | 167.00 | 男     |      7 |           |  2 | python02期  |
        | 16 | 十一   |   15 | 167.00 | 男     |      7 |           |  3 | python04期  |
        | 17 | 十二   |   18 | 176.00 | 男     |      2 |           |  1 | python01期  |
        | 17 | 十二   |   18 | 176.00 | 男     |      2 |           |  2 | python02期  |
        | 17 | 十二   |   18 | 176.00 | 男     |      2 |           |  3 | python04期  |
        +----+--------+------+--------+--------+--------+-----------+----+-------------+
        51 rows in set (0.00 sec)

    select * from studuent inner join classes on studuent.cls_id = classes.id;
        +----+--------+------+--------+--------+--------+-----------+----+-------------+
        | id | name   | age  | height | gender | cls_id | is_delete | id | name        |
        +----+--------+------+--------+--------+--------+-----------+----+-------------+
        |  1 | 小明   |   18 | 168.00 | 女     |      1 |           |  1 | python01期  |
        |  2 | 小黄   |   17 | 175.00 | 男     |      2 |           |  2 | python02期  |
        |  3 | 小红   |   14 | 177.00 | 女     |      3 |           |  3 | python04期  |
        | 13 | 小五   |   13 | 190.00 | 女     |      3 |           |  3 | python04期  |
        | 17 | 十二   |   18 | 176.00 | 男     |      2 |           |  2 | python02期  |
        +----+--------+------+--------+--------+--------+-----------+----+-------------+
        5 rows in set (0.00 sec)

    --按照要求现实姓名和年级
    select studuent.*, classes.name  from studuent inner join classes on studuent.cls_id = classes.id;
        +----+--------+------+--------+--------+--------+-----------+-------------+
        | id | name   | age  | height | gender | cls_id | is_delete | name        |
        +----+--------+------+--------+--------+--------+-----------+-------------+
        |  1 | 小明   |   18 | 168.00 | 女     |      1 |           | python01期  |
        |  2 | 小黄   |   17 | 175.00 | 男     |      2 |           | python02期  |
        |  3 | 小红   |   14 | 177.00 | 女     |      3 |           | python04期  |
        | 13 | 小五   |   13 | 190.00 | 女     |      3 |           | python04期  |
        | 17 | 十二   |   18 | 176.00 | 男     |      2 |           | python02期  |
        +----+--------+------+--------+--------+--------+-----------+-------------+
        5 rows in set (0.00 sec)

    --简写重命名
    select s.*, c.name  from studuent as s inner join classes as c on s.cls_id = c.id;
        +----+--------+------+--------+--------+--------+-----------+-------------+
        | id | name   | age  | height | gender | cls_id | is_delete | name        |
        +----+--------+------+--------+--------+--------+-----------+-------------+
        |  1 | 小明   |   18 | 168.00 | 女     |      1 |           | python01期  |
        |  2 | 小黄   |   17 | 175.00 | 男     |      2 |           | python02期  |
        |  3 | 小红   |   14 | 177.00 | 女     |      3 |           | python04期  |
        | 13 | 小五   |   13 | 190.00 | 女     |      3 |           | python04期  |
        | 17 | 十二   |   18 | 176.00 | 男     |      2 |           | python02期  |
        +----+--------+------+--------+--------+--------+-----------+-------------+
        5 rows in set (0.00 sec)


    --加上排序
    mysql> select s.*, c.name  from studuent as s inner join classes as c on s.cls_id = c.id order by c.name ;
        +----+--------+------+--------+--------+--------+-----------+-------------+
        | id | name   | age  | height | gender | cls_id | is_delete | name        |
        +----+--------+------+--------+--------+--------+-----------+-------------+
        |  1 | 小明   |   18 | 168.00 | 女     |      1 |           | python01期  |
        | 17 | 十二   |   18 | 176.00 | 男     |      2 |           | python02期  |
        |  2 | 小黄   |   17 | 175.00 | 男     |      2 |           | python02期  |
        | 13 | 小五   |   13 | 190.00 | 女     |      3 |           | python04期  |
        |  3 | 小红   |   14 | 177.00 | 女     |      3 |           | python04期  |
        +----+--------+------+--------+--------+--------+-----------+-------------+
        5 rows in set (0.00 sec)


    --更改显示顺序
    select c.name, s.* from studuent as s inner join classes as c on s.cls_id = c.id order by c.name ;
        +-------------+----+--------+------+--------+--------+--------+-----------+
        | name        | id | name   | age  | height | gender | cls_id | is_delete |
        +-------------+----+--------+------+--------+--------+--------+-----------+
        | python01期  |  1 | 小明   |   18 | 168.00 | 女     |      1 |           |
        | python02期  | 17 | 十二   |   18 | 176.00 | 男     |      2 |           |
        | python02期  |  2 | 小黄   |   17 | 175.00 | 男     |      2 |           |
        | python04期  | 13 | 小五   |   13 | 190.00 | 女     |      3 |           |
        | python04期  |  3 | 小红   |   14 | 177.00 | 女     |      3 |           |
        +-------------+----+--------+------+--------+--------+--------+-----------+
        5 rows in set (0.00 sec)

    --多条件排序
    select c.name, s.* from studuent as s inner join classes as c on s.cls_id = c.id order by c.name, s.id, s.age;
        +-------------+----+--------+------+--------+--------+--------+-----------+
        | name        | id | name   | age  | height | gender | cls_id | is_delete |
        +-------------+----+--------+------+--------+--------+--------+-----------+
        | python01期  |  1 | 小明   |   18 | 168.00 | 女     |      1 |           |
        | python02期  |  2 | 小黄   |   17 | 175.00 | 男     |      2 |           |
        | python02期  | 17 | 十二   |   18 | 176.00 | 男     |      2 |           |
        | python04期  |  3 | 小红   |   14 | 177.00 | 女     |      3 |           |
        | python04期  | 13 | 小五   |   13 | 190.00 | 女     |      3 |           |
        +-------------+----+--------+------+--------+--------+--------+-----------+
        5 rows in set (0.00 sec)


--外连接查询(分为左连接右连接)
    --右连接查询




    --左连接查询(那个表在左边，以这个表为基准取查询的信息，取不出来莫认为Null)
    select * from studuent as s  left join classes as c on s.cls_id = c.id;
        +----+--------+------+--------+--------+--------+-----------+------+-------------+
        | id | name   | age  | height | gender | cls_id | is_delete | id   | name        |
        +----+--------+------+--------+--------+--------+-----------+------+-------------+
        |  1 | 小明   |   18 | 168.00 | 女     |      1 |           |    1 | python01期  |
        |  2 | 小黄   |   17 | 175.00 | 男     |      2 |           |    2 | python02期  |
        | 17 | 十二   |   18 | 176.00 | 男     |      2 |           |    2 | python02期  |
        |  3 | 小红   |   14 | 177.00 | 女     |      3 |           |    3 | python04期  |
        | 13 | 小五   |   13 | 190.00 | 女     |      3 |           |    3 | python04期  |
        |  4 | 小汉   |   11 | 180.00 | 中性   |      4 |           | NULL | NULL        |
        |  5 | 小八   |   12 | 187.00 | 中性   |      5 |           | NULL | NULL        |
        |  6 | 小九   |   13 | 182.00 | 保密   |      6 |           | NULL | NULL        |
        |  7 | 小十   |   18 | 188.00 | 中性   |      7 |           | NULL | NULL        |
        |  8 | 小之   |   17 | 186.00 | 女     |      8 |           | NULL | NULL        |
        |  9 | 小一   |   10 | 188.00 | 女     |      9 |           | NULL | NULL        |
        | 10 | 小二   |   15 | 182.00 | 中性   |      9 |           | NULL | NULL        |
        | 11 | 小三   |   18 | 184.00 | 女     |      6 |           | NULL | NULL        |
        | 12 | 小四   |   19 | 185.00 | 保密   |      4 |           | NULL | NULL        |
        | 14 | 小六   |   14 | 189.00 | 女     |      4 |           | NULL | NULL        |
        | 15 | 小七   |   15 | 178.00 | 女     |      5 |           | NULL | NULL        |
        | 16 | 十一   |   15 | 167.00 | 男     |      7 |           | NULL | NULL        |
        +----+--------+------+--------+--------+--------+-----------+------+-------------+
        17 rows in set (0.00 sec)

    --与inner join ... on比较
    select * from studuent as s  inner join classes as c on s.cls_id = c.id;
        +----+--------+------+--------+--------+--------+-----------+----+-------------+
        | id | name   | age  | height | gender | cls_id | is_delete | id | name        |
        +----+--------+------+--------+--------+--------+-----------+----+-------------+
        |  1 | 小明   |   18 | 168.00 | 女     |      1 |           |  1 | python01期  |
        |  2 | 小黄   |   17 | 175.00 | 男     |      2 |           |  2 | python02期  |
        |  3 | 小红   |   14 | 177.00 | 女     |      3 |           |  3 | python04期  |
        | 13 | 小五   |   13 | 190.00 | 女     |      3 |           |  3 | python04期  |
        | 17 | 十二   |   18 | 176.00 | 男     |      2 |           |  2 | python02期  |
        +----+--------+------+--------+--------+--------+-----------+----+-------------+
        5 rows in set (0.01 sec)


    --left是指left左边的数据表
    select * from classes as c left join studuent as s on c.id = s.cls_id;
        +----+-------------+------+--------+------+--------+--------+--------+-----------+
        | id | name        | id   | name   | age  | height | gender | cls_id | is_delete |
        +----+-------------+------+--------+------+--------+--------+--------+-----------+
        |  1 | python01期  |    1 | 小明   |   18 | 168.00 | 女     |      1 |           |
        |  2 | python02期  |    2 | 小黄   |   17 | 175.00 | 男     |      2 |           |
        |  3 | python04期  |    3 | 小红   |   14 | 177.00 | 女     |      3 |           |
        |  3 | python04期  |   13 | 小五   |   13 | 190.00 | 女     |      3 |           |
        |  2 | python02期  |   17 | 十二   |   18 | 176.00 | 男     |      2 |           |
        +----+-------------+------+--------+------+--------+--------+--------+-----------+
        5 rows in set (0.00 sec)

    
    --right join ... on 一般用的比较少  使用左连接调换两个数据表的顺序即可


    --查询没有对应班级信息的学生 
    --思路：对于查询出的结果我们可以将其看作一个新的表，然后在此新表的基础上进行再次操作查询
    --如果在原表里面进行查询使用where
    --在查询的基础上进行再次操作使用having
    select * from studuent as s left join classes as c on c.id = s.cls_id having c.id is NULL;
    select * from studuent as s left join classes as c on c.id = s.cls_id where c.id is NULL; --这样也行

        +----+--------+------+--------+--------+--------+-----------+------+------+
        | id | name   | age  | height | gender | cls_id | is_delete | id   | name |
        +----+--------+------+--------+--------+--------+-----------+------+------+
        |  4 | 小汉   |   11 | 180.00 | 中性   |      4 |           | NULL | NULL |
        |  5 | 小八   |   12 | 187.00 | 中性   |      5 |           | NULL | NULL |
        |  6 | 小九   |   13 | 182.00 | 保密   |      6 |           | NULL | NULL |
        |  7 | 小十   |   18 | 188.00 | 中性   |      7 |           | NULL | NULL |
        |  8 | 小之   |   17 | 186.00 | 女     |      8 |           | NULL | NULL |
        |  9 | 小一   |   10 | 188.00 | 女     |      9 |           | NULL | NULL |
        | 10 | 小二   |   15 | 182.00 | 中性   |      9 |           | NULL | NULL |
        | 11 | 小三   |   18 | 184.00 | 女     |      6 |           | NULL | NULL |
        | 12 | 小四   |   19 | 185.00 | 保密   |      4 |           | NULL | NULL |
        | 14 | 小六   |   14 | 189.00 | 女     |      4 |           | NULL | NULL |
        | 15 | 小七   |   15 | 178.00 | 女     |      5 |           | NULL | NULL |
        | 16 | 十一   |   15 | 167.00 | 男     |      7 |           | NULL | NULL |
        +----+--------+------+--------+--------+--------+-----------+------+------+
        12 rows in set (0.00 sec)